HRMREDChuklinTest.ZUPC/src/InformationRegisters/ZUPC_НовыеCотрудники/ZUPC_НовыеCотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ZUPC_НовыеCотрудники</name>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ActualDepartmentName</name>
    <type>
      <types>CatalogRef.ZUPC_ActualDepartmentName</types>
    </type>
  </resources>
  <resources>
    <name>ActualPositionTitle</name>
    <type>
      <types>CatalogRef.ZUPC_ActualPositionTitle</types>
    </type>
  </resources>
  <resources>
    <name>Desk_Team</name>
    <type>
      <types>CatalogRef.ZUPC_Desk_Team</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ОкладNet</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаТекущая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ОкладИзОффера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГодовойБонусИзОффера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Юр_Лицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДоходАгенства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Агенство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Офис</name>
    <type>
      <types>CatalogRef.ZUPC_Офисы</types>
    </type>
  </resources>
  <resources>
    <name>НомерМеста</name>
    <type>
      <types>CatalogRef.ZUPC_НомерМеста</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизоватьРабочееМесто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СоздатьАккаунт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Пропуск</name>
    <type>
      <types>CatalogRef.ZUPC_Пропуски</types>
    </type>
  </resources>
  <resources>
    <name>МобильныйТелефон</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийДляИТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеСогл</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Перевод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Увольнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаВыхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдаленнаяРабота</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Город</name>
    <type>
      <types>CatalogRef.ZUPC_Locations</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтменаУвольнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Спеллинг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FirstName</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>LastName</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>UserLogonName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РучнойВводИмени</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DateJoingGroup</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаПослеИспСрока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаЧерез6Мес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаЧерезГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаЧерез9Мес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ZUPC_RemoteWorkLocation</name>
    <type>
      <types>CatalogRef.ZUPC_RemoteWorkLocation</types>
    </type>
  </resources>
  <resources>
    <name>Декрет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПовторныйНайм</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SearchSource</name>
    <type>
      <types>EnumRef.ZUPC_SearchSource</types>
    </type>
  </resources>
  <resources>
    <name>Referree</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>AgencyName</name>
    <type>
      <types>CatalogRef.ZUPC_Agency</types>
    </type>
  </resources>
  <resources>
    <name>AgentFee</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СозданОбработкойНачальногоЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>СотрудникСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>201</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HRMREDChuklinTest.ZUPC/src/InformationRegisters/ZUPC_НовыеCотрудники/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьСвойстваДС();
КонецПроцедуры       

&НаСервере
Процедура УстановитьСвойстваДС()    
	СвойстваДинамическогоСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка(); 
	СвойстваДинамическогоСписка.ТекстЗапроса = "ВЫБРАТЬ
	|	ВыполненныеРассылки.Объект КАК Объект,
	|	ВыполненныеРассылки.Рассылка КАК Рассылка
	|ПОМЕСТИТЬ ВТ_Рассылка
	|ИЗ
	|	РегистрСведений.RSN_ВыполненныеРассылки КАК ВыполненныеРассылки
	|СГРУППИРОВАТЬ ПО
	|	ВыполненныеРассылки.Объект,
	|	ВыполненныеРассылки.Рассылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрСведенийНовыеCотрудники.СотрудникСтрока КАК СотрудникСтрока,
	|	РегистрСведенийНовыеCотрудники.Сотрудник КАК Сотрудник,
	|	РегистрСведенийНовыеCотрудники.ДатаВыхода КАК ДатаВыхода,
	|	РегистрСведенийНовыеCотрудники.ActualDepartmentName КАК ActualDepartmentName,
	|	РегистрСведенийНовыеCотрудники.Desk_Team КАК Desk_Team,
	|	РегистрСведенийНовыеCотрудники.ActualPositionTitle КАК ActualPositionTitle,
	|	РегистрСведенийНовыеCотрудники.ДолжностьСтрокой КАК ДолжностьСтрокой,
	|	РегистрСведенийНовыеCотрудники.Руководитель КАК Руководитель,
	|	РегистрСведенийНовыеCотрудники.Валюта КАК Валюта,
	|	РегистрСведенийНовыеCотрудники.Юр_Лицо КАК Юр_Лицо,
	|	РегистрСведенийНовыеCотрудники.Спеллинг КАК Спеллинг,
	|	РегистрСведенийНовыеCотрудники.ДоходАгенства КАК ДоходАгенства,
	|	РегистрСведенийНовыеCотрудники.Агенство КАК Агенство,
	|	РегистрСведенийНовыеCотрудники.Офис КАК Офис,
	|	РегистрСведенийНовыеCотрудники.НомерМеста КАК НомерМеста,
	|	РегистрСведенийНовыеCотрудники.ОрганизоватьРабочееМесто КАК ОрганизоватьРабочееМесто,
	|	РегистрСведенийНовыеCотрудники.СоздатьАккаунт КАК СоздатьАккаунт,
	|	РегистрСведенийНовыеCотрудники.Пропуск КАК Пропуск,
	|	РегистрСведенийНовыеCотрудники.МобильныйТелефон КАК МобильныйТелефон,
	|	РегистрСведенийНовыеCотрудники.КомментарийДляИТ КАК КомментарийДляИТ,
	|	РегистрСведенийНовыеCотрудники.НеСогл КАК НеСогл,
	|	РегистрСведенийНовыеCотрудники.Перевод КАК Перевод,
	|	РегистрСведенийНовыеCотрудники.Увольнение КАК Увольнение,
	|	РегистрСведенийНовыеCотрудники.ОтменаВыхода КАК ОтменаВыхода,
	|	РегистрСведенийНовыеCотрудники.УдаленнаяРабота КАК УдаленнаяРабота,
	|	РегистрСведенийНовыеCотрудники.Город КАК Город,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Рассылка.Объект, 0) <> 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Состояние,
	|	РегистрСведенийНовыеCотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ZUPC_НовыеCотрудники КАК РегистрСведенийНовыеCотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Рассылка КАК ВТ_Рассылка
	|		ПО РегистрСведенийНовыеCотрудники.СотрудникСтрока = ВТ_Рассылка.Объект";   
	СвойстваДинамическогоСписка.ОсновнаяТаблица = "РегистрСведений.ZUPC_НовыеCотрудники";
	Список.ПроизвольныйЗапрос = Истина;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваДинамическогоСписка);

КонецПроцедуры
